Revit 2026 API

# FilterInverseRuleSetInnerRule Method

---

Gets the rule being inverted.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetInnerRule(
	FilterRule innerRule
)
```
```vb
Public Sub SetInnerRule (
	innerRule As FilterRule
)
```
```cpp
public:
void SetInnerRule(
	FilterRule^ innerRule
)
```
```fsharp
member SetInnerRule :
        innerRule : FilterRule -> unit
```

#### Parameters

innerRule FilterRule
     The rule to invert.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

FilterInverseRule Class

Autodesk.Revit.DB Namespace